name: "preprocess"
backend: "python"
max_batch_size: 16

input [
  {
    name: "preprocess_input"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]

output [
  {
    name: "preprocess_output"
    data_type: TYPE_FP32
    dims: [ 3, 224, 224 ]
  }
]

instance_group [
  {
      count: 1
      kind: KIND_CPU
  }
]