name: "preprocess"
backend: "python"
max_batch_size: 1

input [
  {
    name: "INPUT_0"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]

output [
  {
    name: "preprocess_output_0"
    data_type: TYPE_FP32
    dims: [ 3, -1, -1 ]
  },
  {
    name: "preprocess_output_1"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

instance_group [
  {
      count: 1
      kind: KIND_CPU
  }
]